#                   Текущие тенденции в разработке мобильных приложений.


# Существует несколько текущих тенденций в разработке мобильных приложений, 

# которые формируют индустрию и определяют будущее этой области:


#        1.Увеличение использования искусственного интеллекта (ИИ): 

# Разработка мобильных приложений продолжает активно развиваться, становясь все более функциональной 
# и сложной. От простых игр и калькуляторов на первых смартфонах, до серьезных бизнес-приложений сегодня,
# таких как медицинские, ecom и банковские приложения. Однако, с ростом количества приложений, 
# растет и конкуренция. Это требует от разработчиков еще большого труда и креативных решений, 
# чтобы создать что-то по-настоящему интересное и удобное для пользователей.

# Используя новейшие технологии современные мобильные приложения, разработанные с возможностями 
# использования искусственного интеллекта, машинного обучения и аналитики больших данных предлагают 
# множество функциональных возможностей, ранее недоступных для бизнеса. Они позволяют предсказывать 
# поведение пользователей, создавать персонализированные предложения товаров и услуг, быстро и 
# безопасно проводить банковские транзакции автоматически распознавая фрод операции, 
# транслировать контент в различных форматах на любой язык, распознавать голосовые 
# команды и многое другое.

# В этой статье расскажем, как искусственный интеллект помогает вывести мобильные 
# приложения на 
# новый уровень.

# Рекомендательные системы
 

# Для улучшения функционала и достижения высокой персонализации контента, при разработке 
# рекомендательных систем в приложениях начали применять алгоритмы машинного обучения. 
# Благодаря таким алгоритмам пользователи могут получать именно то, что им интересно, 
# на основе своих действий и предпочтений. 

# Системы могут использовать различные подходы, такие как коллаборативная фильтрация, 
# контентная фильтрация, гибридные подходы и другие. Но независимо от типа используемой 
# системы или ее подходов, цель остается одна: помочь пользователям получить наилучший 
# опыт использования мобильных приложений.

# Например, многие онлайн-кинотеатры предлагают свои лучшие и рекомендованные фильмы на 
# основе анализа уже просмотренных пользователем фильмов и на основании этих данных составляют 
# уникальный ленту рекомендаций. В ходе анализа данных учитываются разнообразные факторы, 
# включая жанр фильма, рейтинг, сезонность, схожесть или различия с другими фильмами, 
# а также историю просмотров и оценок других пользователей. Аналогично выполняется работа с 
# рекомендациями в музыкальных сервисах и интернет-магазинах. 

# Голосовые помощники и голосовой поиск
 
# Преобразования речи в текст активно используется в различных мобильных приложениях, 
# от управления умным домом до транскрибирования занятий и интервью. 
# Также преобразование речи в текст часто используется, в приложениях для записи голосовых 
# заметок или диктовки текста. Развитие технологий искусственного интеллекта и обработки 
# речевых алгоритмов, делают процесс преобразования и анализ запросов более точным и эффективным.

# Используя голосовые команды вместо набора текста, голосовой поиск делает процесс поиска 
# информации в интернете более удобным для пользователя. Это особенно удобно при поиске 
# ресторанов или прокладке маршрутов на карте.

# Такие голосовые помощники, как Siri, Google Assistant и Алиса, предоставляют множество функций, 
# которые существенно упрощают жизнь рядовых пользователей позволяя им взаимодействовать с 
# устройствами и приложениями через голосовые команды. Они также могут отвечать на вопросы, 
# выполнять различные задачи, например, отправлять сообщения или устанавливать напоминания, 
# совершать покупки в онлайн-магазинах, управлять устройствами умного дома.

# Обработка изображений и визуальный поиск

# Современное мобильное ecom приложение это больше, чем просто каталог с товарами. 
# Сегодняшние потребители ожидают больше интерактивности и удобства в своем интернет опыте. 
# Именно поэтому, «визуальный поиск» стал одним из новых и популярных трендов в мобильных приложениях 
# электронной коммерции.

# Визуальный поиск позволяет покупателям сократить время на поиски необходимых товаров, 
# делая процесс покупок еще более простым и удобным находя товары в магазинах, используя лишь 
# фотографии или изображения. К примеру, пользователи могут сфотографировать в магазине желаемый 
# товар или найти товары, которые они не могут описать словами, например, если они увидели 
# интересную вещь на улице или в социальных сетях. Используя алгоритмы машинного обучения для 
# анализа изображений и поиска соответствующих товаров в базе данных из загруженных пользователями 
# изображений, приложение в котором есть визуальный поиск найдет или подберет аналоги этого изделия 
# из ассортимента интернет-магазина. 

# Визуальный поиск также помогает магазинам улучшить пользовательский опыт покупателей. 
# Имея новый инструмент поиска, магазины могут привлечь больше покупателей и увеличить продажи. 
# Кроме того, они могут получить полезную статистику о предпочтениях покупателей и адаптировать 
# свой ассортимент на их основе.

# В заключение, мобильные приложения электронной коммерции с визуальным поиском становятся все 
# более популярными, и еще больше магазинов внедряют этот подход в своей деятельности. 
# Это дает безграничные возможности для тех, кто хочет оптимизировать свой бизнес и улучшить 
# взаимодействие с клиентами. Онлайн магазины, которые не хотят отставать, должны рассмотреть 
# возможность внедрения этой инновационной технологии в своих приложениях.

#   Аналитика данных
# В настоящее время, обработка больших объемов данных является обязательным условием для 
# успешной работы бизнеса. Стандартные методы анализа, которые использовались ранее, 
# перестали быть эффективными. Большие объемы данных производятся в различных сферах, 
# телекоммуникации, здравоохранение, электронная коммерция и различные виды сервисов.

# Для того, чтобы справиться с такими объемами данных, мобильные приложения начали использовать 
# технологии искусственного интеллекта и машинного обучения. Использование этих технологий 
# позволяет приложениям структурировать большие объемы данных и проводить аналитику.

# К примеру, если рассмотреть мобильное приложение, разработанное для водителей такси, 
# искусственный интеллект и машинное обучение позволяют учитывать большое количество 
# параметров для того, чтобы привести машину к месту назначения как можно быстрее и безопаснее.
# Система может анализировать погодные условия, наличие пробок на дорогах, складывать информацию 
# о предыдущих заказах и предсказывать, сколько времени займет следующий заказ. Благодаря этому, 
# приложение становится более удобным и функциональным для пользователей.

# Еще одним способом использования машинного обучения в мобильных приложениях является 
# оптимизация рекламы. Например, приложения могут использовать данные пользователей 
# (например, их демографические характеристики и предпочтения) для показа релевантной рекламы. 
# Это значительно повышает вероятность, что пользователь нажмет на рекламу и возможно совершит покупку.

# Кроме того, машинное обучение может помочь в анализе данных, что помогает бизнесу принимать 
# более осознанные решения. Например, электронная коммерция может использовать машинное 
# обучение для анализа данных о продажах и прогнозирования будущих продаж. 
# Это позволяет компаниям принимать решения о запасах, ценообразовании и маркетинге.

# Безопасность
 
# Одним из примеров использования искусственного интеллекта является автоматическое обнаружение 
# аномальной активности аккаунта. Алгоритмы машинного обучения анализируют поведение пользователя, 
# чтобы выявить любые необычные действия, которые могут указывать на возможное нарушение безопасности. 
# Например, если на аккаунт внезапно заходят с устройства, которое ранее не использовалось, 
# система может прекратить доступ или запросить пароль на подтверждение личности.

# Другой пример использования науки о данных - это анализ трафика в приложении для поиска 
# незащищенных областей и уязвимых мест. Алгоритмы искусственного интеллекта могут обнаружить 
# подозрительный трафик, который может указывать на попытки злоумышленника получить доступ к 
# личным данным, данные технологии широко используются в банковской сфере.

# Помимо этого, приложения могут использовать методы шифрования и подписывания данных, 
# что защищает данные от попыток несанкционированного доступа. Пользовательский интерфейс может 
# быть также настроен на уведомление о попытках входа в аккаунт или изменениях настроек без 
# санкции пользователя.

# Большинство сервисов применяют искусственный интеллект для обеспечения безопасности данных 
# пользователей, используя функции, такие как распознавание лиц и отпечатков пальцев с 
# помощью Face ID и Touch ID.

# А еще благодаря ИИ можно автоматически распознавать фальшивые документы и идентифицировать 
# поддельные профили пользователей.

# Искусственный интеллект приносит мобильным приложениям немалое преимущество. 
# Он способен обрабатывать большие объемы информации, анализировать поведение пользователей, 
# исправлять ошибки, предотвращать мошенничество, улучшать безопасность и оптимизировать 
# бизнес-процессы. Все эти возможности оказывают положительное влияние на удовлетворенность 
# пользователей и эффективность приложений.Разработка мобильных приложений с использованием 
# искусственного интеллекта является сложной задачей, но L-TECH готова разработать для вас 
# мобильное приложение под ключ любой сложности. Наши приложения надежны, безопасны и удобным 
# для пользователей, это подтверждается тысячи положительных отзывов в магазинах приложений. 
# Если вы хотите заказать разработку мобильного приложения или внедрить технологии искусственного 
# интеллекта в уже существующее приложение, расскажите нам о своем проекте. 
# Мы с удовольствием проконсультируем вас, ответим на любые вопросы, 
# подберем нужный технологический стек для вашей идеи, оценим сроки и стоимость реализации проекта.

#         2.Увеличенная реальность (AR) и виртуальная реальность (VR): 

# AR и VR становятся все более популярными в мобильных приложениях, 

# используя их для игр, образования, обучения и симуляции.

# С помощью искусственного интеллекта создаются интерактивные миры, в которых с различной степенью 
# сходства имитируется человеческая реальность.

# Ощущения передаются пользователю через его органы чувств, прежде всего зрение, слух, осязание. 
# Для полноты картины могут подключаться даже запахи.

# Поискать в своём городе покемона, примерить платье онлайн, поучаствовать в битве фантазийных 
# персонажей, стать пилотом самолёта — всё это возможности, которые открывает виртуальная реальность. 
# И разработчики создают всё новые способы применения VR и AR не только в качестве развлечения, 
# но и в других сферах жизни.

# Принцип работы технологии виртуальной реальности
# Параллельно развиваются три типа искусственной реальности:

# виртуальная;
# дополненная;
# смешанная.
# У каждого из них — свои особенности. Смешанная, или Mixed Reality (MR), — вариант гибридного 
# применения обеих технологий.

# Virtual Reality:
# Виртуальная реальность полностью создаётся компьютером. Самый распространённый способ попасть 
# в VR — специальные очки или шлемы. Это гарнитура, которая проводным или беспроводным способом 
# подключается к компьютеру, игровой консоли или смартфону.

# Внутри расположены один или два ЖК-дисплея, часто применяют Super-fast LCD и OLED. 
# Масштаб картинки и настройка стереоскопического изображения регулируется встроенными линзами. 
# Традиционно угол обзора составляет около 100 градусов — этого достаточно, чтобы устранить 
# эффект экрана и полностью погрузить в искусственный мир.

# На дисплее видео отображается с частотой кадров от 60 до 120 в секунду. Минимальное время задержки, 
# как правило, не более 50 мс.

# Фокусировка взгляда, размытие переднего или заднего плана, движение картинки вслед за глазами 
# усиливают эффект присутствия. Это возможно благодаря тому, что ИК-датчики внутри гарнитуры отслеживают взгляд. Такая функция есть не во всех представленных на рынке шлемах.

# Ещё одна составляющая технологии — трекинг. Это отслеживание движения головы и тела пользователя. 
# Есть два способа трекинга:

# Внутренний. Датчики и широкоугольные камеры с подсветкой располагаются непосредственно на шлеме и 
# фиксируют положение тела и окружающих предметов. Основные считывающие движения устройства — гироскоп 
# и акселерометр. Метод может быть неточным: система не всегда распознаёт руки за спиной или 
# скрещённые ноги. Проблему решают контроллеры, которые пользователь держит в руках. 
# Они не только фиксируют движения, но и позволяют управлять инвентарём.
# Внешний. В помещении напротив друг друга на штативах или других возвышенностях располагаются 
# датчики-маяки, которые замыкают игровое пространство. С помощью высокочастотных миганий 
# маяки постоянно контролируют малейшие изменения положения тела игрока и передают данные 
# компьютеру для корректировки картинки на дисплее. Способ максимально точный и эффективный.
# Некоторые производители предлагают дополнительные устройства для комфортного нахождения в 
# вымышленной среде — «умные» перчатки, беговые дорожки для имитации ходьбы и даже оборудование 
# для управления средой голосом.

# Технологии прогнозируют стремительный рост. Уже скоро в свободном доступе могут появиться VR костюмы, 
# в разы увеличивающие степень погружения и остроту ощущений.

# Чаты, социальные сети, ивенты в других измерениях станут доступнее. 
# Любой пользователь сможет присутствовать на них в виде аватара.

# Augmented Reality:
# В дополненной реальности графическая картинка накладывается на реальную и создаётся единая плоскость, 
# которую видит пользователь на экране своего устройства.

# С технологией знаком любой пользователь социальных сетей — различные фильтры и маски на видео 
# позволяют создавать интересный запоминающийся контент. Прицелы на военной технике, 
# выведенные на экран бортовым компьютером, — это тоже дополненная реальность.

# Принцип работы основан на обучении нейросети. Она учится распознавать объекты и маркеры реальности, 
# а также фиксировать местоположение.

# По загруженной библиотеке образов с описанием их общих черт сеть распознаёт, например, 
# глаза человека или автомобиль на улице. Если нужно расположить графику в конкретном месте, 
# на него фиксируется маркер — цифровой код. При наведении камеры на эту точку в кадре появится 
# нужное изображение.

# Всё окружающее пространство искусственный интеллект разделяет на карту точек и плоскостей, 
# по которым может определить местоположение пользователя.

# С помощью AR-технологии любое мобильное приложение можно дополнить полезными опциями, например, 
# возможностью измерять размеры и расстояния без реальной рулетки или видеть карту звёзд прямо 
# на небе в режиме реального времени. И создать это не так сложно, как кажется.

# В открытом доступе есть различные сервисы, которые способны точно определять расположение 
# камеры и размещать в выделенной точке графические 3D-объекты.

# Например, инструмент Naviar SDK от команды разработчиков SberDevices позволяет интегрировать 
# дополненную реальность в любой проект.

# Сходство между виртуальной и дополненной реальностью
# Сходство VR и AR выражено в обобщённых чертах:

# Созданы с использованием схожих технологий. Прежде всего это трекинг, который позволяет 
# определить положение пользователя в пространстве и направление фокуса его объектива.
# Служат для одних и тех целей — развлекательных, познавательных, исследовательских, обучающих — и 
# в целом улучшают качество жизни людей.
# Стали результатом развития IT-технологий и совершенствуются параллельно.
# Несут в себе большой потенциал для новых прорывов в науке, медицине, промышленности и других сферах.
# В остальном это два разных направления IT-индустрии с очевидным разграничением сфер применения 
# и с различной доступностью для пользователей.

# Различия между виртуальной и дополненной реальностью
# Виртуальная реальность создаёт мир без границ. Экран, расположенный перед глазами, 
# ведёт пользователя по выдуманному миру, полностью блокируя настоящий. В AR графика 
# накладывается на реальную картинку.

# VR взаимодействует только с пользователем в рамках вымышленного мира. Дополненная —встраивается 
# в окружающее пространство в различных форматах. AR может не только накладывать графику на реальное 
# изображение, но и считывать информацию с действительности. Именно так устроена библиотека 
# Kidsar SDK от Sber. Сервис создан для расширения возможностей устройства Sber Portal. 
# Экран благодаря специальному зеркалу для камеры и набору карточек превращается в полноценный 
# интерактивный развивающий комплекс для детей. Оптика считывает действия ребёнка и переносит 
# их на монитор, даёт подсказки и в игровой форме обучает новому. С помощью технологии можно 
# создавать детские игры любого формата — викторины, направленные на изучение языков, животных, 
# цветов, явлений природы и т. д.

# Для доступа к технологиям используются разные устройства:

# для VR — очки, шлемы и даже целые комнаты, оборудованные аппаратурой, воздействующей на 
# органы чувств человека;
# для AR — экраны мобильных устройств, которые дополняют мир через объектив камер.
# Пользователь VR настолько забывает, что он в выдуманном пространстве, что это может ввести в 
# заблуждение его вестибулярный аппарат. В шлеме иногда укачивает, поэтому понадобится время, 
# чтобы привыкнуть.

# Есть устройства с забралами, которые можно откинуть, чтобы вернуться в реальность и перевести дух.

# Использование виртуальной и дополненной реальностей
# Основное направление внедрения искусственной реальности — развлекательно-игровые сервисы. 
# Пользователи ходят на виртуальные концерты, обустраивают цифровые города, полностью погружаются 
# в любимые игры.

# AR популярна в индустрии красоты: клиент может предварительно подобрать оттенок волос или 
# оценить на себе подобранный стилистом образ.

# Аналогичным образом работают приложения, где пользователи самостоятельно дополняют внешность 
# вариантами стрижек, макияжа, примеряют забавные маски. При создании таких сервисов разработчики 
# могут пользоваться готовыми библиотеками.

# Например, приложение для ассистентов Салют «Чудо-книжки» создано с помощью сервиса MagicLook SDK 
# от Sber. Во время его использования ребёнок может увидеть себя на экране в виде персонажей сказок 
# благодаря анимированным 3D-маскам.

# Технологии искусственной реальности применяются и в других сферах:

# Образование. В интерактивном мире тренируются будущие пилоты и капитаны кораблей, изучают историю 
# и археологию студенты высокотехнологичных учебных заведений. В школах проводят VR-уроки астрономии, 
# биологии и других предметов. AR применяют в некоторых автошколах для имитации других участников 
# дорожного движения. Таким же образом оживают персонажи детских развивающих книжек.
# Медицина. Будущие врачи быстрее освоятся в профессии, если смогут проводить тренировочные операции 
# и изучать анатомию с помощью погружающих лекции об устройстве человеческого тела. 
# На вымышленных пациентах можно опробовать экспериментальные хирургические методы, 
# а лекции дополнить графикой для наглядности.
# Наука. В VR-пространстве возможны безопасные опыты с атомами, ядовитыми химическими веществами, 
# здесь можно моделировать сценарии различных событий и проводить социологические и другие исследования.
# Архитектура и инженерия. Плоские макеты можно превратить в масштабные VR-презентации, 
# в которых заказчик сможет изучить каждую деталь и увидеть, как будет выглядеть итоговый объект. 
# Дизайнеры с помощью AR-технологий смогут продемонстрировать как изменится помещение, если добавить 
# некоторые объекты или изменить цвет стен.
# Фактически применение искусственной реальности безгранично. Покупатель недвижимости может 
# осмотреть её, даже если находится за тысячи километров.

# Крупное предприятие покажет покупателям своей продукции все этапы производства во время VR-экскурсии. 
# Студия восточных практик проведёт медитацию в тихом саду или на берегу моря.

# Виртуальная реальность за более чем полувековую историю развития прошла путь от военных 
# технологий до распространения в десятки сфер жизни человека. Разработчики стремятся 
# совершенствовать их с позиции пользы для общества, поэтому в ближайшие несколько лет 
# будут создаваться новые сложные и интересные проекты. Можно ожидать, что VR уведёт 
# многие социальные стороны жизни в вымышленные миры, AR-обзором будет дополнен каждый 
# автомобиль и в целом обе технологии помогут оптимизировать и автоматизировать многие процессы.


#            3.Интернет вещей (IoT): 

# Начнем с того, что определим, что такое IoT (интернет вещей)
# Интернет вещей (IoT) — это об огромном количестве «вещей», которые подключены к Интернету 
# для обмена данными с другими вещами — приложениями IoT, подключенными устройствами, 
# промышленными машинами и многим другим. Устройства, подключенные к Интернету, используют 
# встроенные датчики для сбора данных и, в некоторых случаях, воздействуют на них. 
# Подключенные к IoT устройства и машины могут улучшить нашу работу и жизнь. 
# Примеры применения Интернет вещей (IoT): от умного дома, который автоматически 
# регулирует отопление и освещение, до умной фабрики, которая контролирует промышленные 
# машины для поиска проблем, а затем автоматически настраивается, чтобы избежать сбоев.

# Насколько мобильные приложения с улучшенными функциями Интернет вещей (IoT) влияют на бизнес?
# Приложения с поддержкой Интернет вещей (IoT) вошли почти во все вертикали и кардинально 
# изменили способ функционирования бизнесов. Конечно, мобильное приложение — это только часть 
# инфраструктуры Интернет вещей (IoT).

# Однако в сочетании с новыми техническими достижениями и технологиями на данный момент это может 
# повысить ваши продажи и уровень производительности, а также полностью изменить 
# способ ведения бизнеса.

# Доступность: мобильность мобильного телефона гарантирует, что его пользователь имеет 
# круглосуточный доступ к управлению системой IoT.
# Больше данных для анализа: системы Интернет вещей (IoT) собирают и обрабатывают данные с датчиков, 
# подключенных устройств и мобильных телефонов. Когда смартфон становится еще одним элементом 
# подключенной инфраструктуры, он предоставляет массу данных о привычках, предпочтениях и 
# образе жизни своих пользователей, что открывает двери для более персонализированных рекламных акций, 
# домашних настроек и других вариантов использования. Эти элементы в дальнейшем используются службами 
# разработки мобильных приложений для персонализации приложений.
# Расширенный пользовательский опыт (UX)
# Однако, стремясь сделать мобильные приложения удобными для конечных пользователей, 
# компании-разработчики приложений Интернет вещей (IoT) больше не сосредотачиваются исключительно 
# на предоставлении удобных интерфейсов. Сегодня мобильные приложения, входящие в сеть IoT, 
# создаются с учетом лучшей интеграции с другими подключенными устройствами. Они должны, 
# с одной стороны, взаимодействовать с другими частями системы; с другой стороны, ожидается, 
# что они осознают преимущества приложений, а именно портативность, интуитивно понятное
# использование и бесшовную интеграцию в повседневную рутинную деятельность.

# Ориентированные на потребителя приложения в промышленном IoT
# В далеком 2017 году Sundar Krish, генеральный директор Waygum.i, заявлил что:

# «Обычно считается, что промышленный IoT ускоряется за счет того, что несколько технологий и 
# продуктов становятся лучше и дешевле — в сенсорах, периферийных вычислениях, облаке, 
# сетевых подключениях и пространствах big data [...] Однако одна мега-тенденция, 
# которая на самом деле способствует гораздо больше для Industrial IoT, 
# хотя и недооценивается, — это мобильные приложения».

# Причина понятна: сегодня почти у каждого человека, включая промышленных рабочих, есть смартфон, 
# обеспечивающий круглосуточный доступ к подключенной инфраструктуре. Этот взрывной рост 
# пользовательской базы можно использовать по-разному.

# Удаленное наблюдение
# С помощью мобильного телефона любой подключенный продукт может быть доступен из любого места 
# в любое время.

# «Де-факто случай использования любой промышленной системы IoT — это мониторинг», — заявлял тот 
# же Сундар Криш (Sundar Krish).

# Де-факто (лат. de facto — «на деле», «фактически») — латинское выражение, означающее нечто 
# действительное, проверенное на опыте, но не закреплённое законом.

# Нефтегазовая промышленность, производственные предприятия, металлургические заводы — любая отрасль 
# может улучшить свою политику профилактического обслуживания, установив эффективное корпоративное 
# решение IoT и предоставив своим сотрудникам приложение для мониторинга в реальном времени поверх него. 
# Такие приложения представляют собой информационную панель, позволяющую пользователям просматривать 
# данные о производительности оборудования в виде диаграмм, диаграмм и графиков, а также получать 
# предупреждения, если что-то пойдет не так.

# Клиенты также могут воспользоваться функцией удаленного мониторинга. Mercedes-Benz, один из 
# пионеров использования интеллектуальных технологий и облака в автомобилестроении, 
# продемонстрировал

# как это можно сделать с помощью приложения Mercedes Me. Мобильное приложение предоставляет 
# пользователям удаленное управление автомобилем, а также подробную информацию для диагностики и 
# помощи в ремонте автомобиля.

# Мобильный рабочий процесс
# Автоматизация и оцифровка — вот два ключевых слова сегодняшней промышленной трансформации. 
# Интернет вещей предоставляет все необходимые инструменты повышения эффективности процессов 
# для этой трансформации, повышая производительность труда сотрудников.

# Уж простите, приведу пример из европейских компаний. А точнее из Ирландии. 
# Мы кстати уже длительное время работаем с западными компаниями, учимся у них опыта и 
# предоставляем мобильные приложения на их рынок.

# Пример: электростанции Уайтгейт компании Bord Gáis Energy в Ирландии. 
# Компания использует передовое решение управления производительностью активов (APM) для оцифровки 
# объекта. Благодаря платформе, электростанция имеет круглосуточный мониторинг с 
# помощью более 140 датчиков, расположенных по всему месту.

# Промышленные рабочие имеют сводное представление о производительности предприятия вместе с 
# предупреждениями о непредвиденных проблемах, чтобы предприятие могло предотвратить крайне 
# нежелательные и дорогостоящие простои. Вся эта информация отображается на экранах компьютеров 
# и мобильных телефонов.

# Продвижение периферийных вычислений
# Мобильные приложение может быть добавлено к массе датчиков, объединенных в экосистему IoT, 
# и может служить как модемом, так и периферийным устройством.

# Интеграция Интернет вещей (IoT) в финансовый сектор:

# В последнее время много говорится о слиянии IoT и Blockchain. В то время как для первого 
# необходим безопасный метод автоматизации процессов и обмена данными, последний может обеспечить 
# требуемый уровень безопасности для управления передачей данных между подключенными устройствами.

# Мобильные приложения на основе блокчейн имеют множество преимуществ для среды IoT. 
# Они децентрализованы (информация не хранится в одном объекте), неизменяемы 
# (без изменений записи в реестры могут производиться без согласия сети) и 
# неконтролируемы никакими властями. Эти характеристики позволяют гарантировать безопасность 
# по двум наиболее уязвимым темам — персональным данным и финансам.

# Мобильные приложения как часть инфраструктуры Интернет вещей (IoT) могут улучшить многие операции, 
# в том числе:

# Управление персональными данными в любом проекте IoT.
# Платежи и переводы в финансовых операциях.
# Подписание контрактов путем применения смарт-контрактов.
# Мониторинг здоровья в Smart Hospital и подключенных системах здравоохранения.
# Системы Интернет вещей (IoT), включающие транзакции, связанные с деньгами, 
# документооборотом или контрактами, выиграют только в том случае, если связанные с 
# ними мобильные приложения будут такими же безопасными и стабильными, как функционирование блокчейна.

# Успешный пример технологии блокчейн, интегрированной в IoT, а именно разработки 
# мобильных приложений — Chronicled. Приложение, поддерживаемое технологией блокчейн, 
# используется для безопасного отслеживания документов и изменений в них, таких как новые версии, 
# исправления и обновления статуса.

# Персонализированный пользовательский опыт в розничной торговле (e-commerce)
# Несмотря на то, что онлайн-покупки становятся все популярнее, обычные магазины остаются 
# привлекательными для клиентов. Они расширяют свое присутствие в Интернете и внедряют новые 
# стратегии продаж, в то время как интернет-магазины открывают физические магазины 
# (так называемая тенденция «кликов на кирпичи»).

# Приложения с поддержкой BLE, умные полки, сотрудники-роботы — это лишь некоторые из 
# элементов современных технологически продвинутых физических магазинов.

# Интернет вещей — это важный инструмент, влияющий на весь процесс совершения покупок. 
# Он открывает путь к новым типам данных из новых источников в соответствии с тенденцией 
# «Знай своего клиента» (KYC): счетчики трафика в магазинах, киоски, бирки инвентаря и мобильные 
# телефоны клиентов с установленными приложениями. Розничные торговцы научились использовать 
# мобильные приложения в своих подключенных системах.

# Навигация в магазине
# С помощью своих мобильных телефонов клиенты могут легко найти товары, которые они ищут. 
# Некоторые крупные розничные торговцы, такие как Lowe’s, уже внедрили эту технологию, 
# чтобы сделать покупки более удобными для своих клиентов. Мобильные приложения с поддержкой 
# Интернет вещей (IoT) ищут товары, добавляют их в список покупок и находят в магазине.

# Другие розничные торговцы делают еще один шаг вперед и предоставляют покупателям дополнительные услуги. 
# Например, мобильное приложение Sephora из простого помощника по навигации превратилось 
# в помощник в магазине. Когда покупатель входит в магазин, приложение предоставляет рекомендации 
# по продукту на основе профиля этого пользователя и истории покупок.

# Автоматизированная касса
# Киоски самообслуживания позволяют клиентам оплачивать свои покупки без вмешательства человека: 
# система настройки считывает теги на товарах и автоматически рассчитывает стоимость из 
# мобильного платежного приложения клиента.

# Такой подход экономит время покупателей, особенно в условиях нехватки времени, и экономит 
# деньги розничных продавцов, сокращая количество сотрудников и делая магазин более привлекательным. 
# Магазины Amazon Go были пионерами в этой технологической области; Теперь количество 
# розничных торговцев, которые запустили мобильные решения для автоматизированных систем кассы, 
# значительно увеличилось, и сегодня они включают таких гигантов розничной торговли, 
# как Walmart и Target. (Опять пример из запада)

# Персонализированные акции и скидки
# Мобильные приложения, взаимодействующие с датчиками в магазине и другими элементами системы IoT, 
# позволяют делать индивидуальные предложения по лучшим ценам. 
# Розничные продавцы могут отправлять скидки за лояльность, когда рядом обнаруживается определенный 
# покупатель, тем самым выстраивая с ними лояльные отношения.

#         4.Мобильная безопасность: 

# Развитие высоких технологий и тренд мобильности привели к тому, что современное мобильное устройство 
# зачастую используется в качестве мобильного офиса, центра развлечений и инструмента для потребления 
# интернет-контента. Сам аппарат многое может рассказать о своем владельце, 
# так как в его памяти хранятся: контакты коллег, друзей и близких с их персональными данными, 
# журнал звонков, переписка, параметры точек доступа Wi-Fi, которые расположены в пределах ареала 
# обитания владельца, приложения социальных сетей (зачастую с сохраненными паролями, 
# банковские реквизиты или мобильный банк, фото и видео, заметки и пр.

# То, насколько стремительно Интернет и мобильные устройства проникли в нашу жизнь видно из 
# исследований размещенных на портале DataReportal.


# Численность населения на начало 2023 года - 8,01 млрд человек;
# Пользователей мобильных телефонов - 5,44 млрд человек;
# Пользователей интернета - 5,16 млрд человек;
# Пользователей социальных сетей - 4,76 млрд человек.
# Ниже видно как изменились эти значения по сравнению с аналогичным периодом прошлого года:


# По этим данным видно, что число пользователей мобильных устройств в мире увеличилось 
# за год на 168 млн человек!

# А вот так проводят пользователи время в сети:


# На начало 2023 года в Российской Федерации насчитывалось 127,6 млн интернет-пользователей, 
# проникновение интернета составляло 88,2%

# В январе 2023 года в России было 106,0 млн пользователей социальных сетей, 
# что составляет 73,3 процента от общей численности населения.

# Всего на начало 2023 года в России было активно 227,0 млн сотовых мобильных подключений, 
# что соответствует 156,9% всего населения.

# Такая концентрация активностей вокруг мобильных устройств и приложений, деловых и 
# персональных данных, хранящихся в них, приводит к тому, что абстрактная стоимость информации 
# перевешивает цену самого устройства. Именно поэтому задача защиты мобильного устройства 
# как от киберугроз так и от банальной утери или выхода из строя является критически важной. 
# К сожалению, часть пользователей осознает важность этих задач лишь постфактум.

# Обеспечение безопасности мобильных приложений начинается со старта разработки, 
# ведь уже на старте проекта можно позаботится о его защите.

# Об описании уязвимостей мобильных приложений позаботилось сообщество 
# OWASP (Open Web Application Security Project). Это открытый проект обеспечения безопасности 
# веб-приложений, в который входят корпорации, образовательные организации и частные лица со всего мира, 
# лучшие эксперты отрасли. В рамках этого проекта были классифицированы основные уязвимости, 
# определены меры по борьбе с ними. В результате появился документ 
# под названием OWASP Mobile TOP-10. Рассмотрим этот документ более подробно.

# 1. Обход архитектурных ограничений (М1: Improper Platform Usage). 
# Категория охватывает злоупотребление особенностями платформы, 
# обхода ограничений или неиспользования систем контроля управления безопасности платформы. 
# В качестве одной мер по защите можно рекомендовать использование Intent в Android-приложениях и 
# Keychain в iOS.

# protected void onCreate(Bundle savedInstanceState) {
#   super.onCreate(savedInstanceState);
#   setContentView(R.layout.activity_main);

#   explicit_btn = (Button)findViewById(R.id.explicit_Intent);

#   explicit_btn.setOnClickListener(new View.OnClickListener() {
#       @Override
#       public void onClick(View v) {
#           Intent intent = new  Intent(getBaseContext(), SecondActivity.class);
#           startActivity(intent);
#       }
#   });
# }
# Листинг 1. Использование Intent в Android-приложении.

# {
#   let keychainItemQuery = [
#       kSecValueData: pass.data(using: .utf8)!,
#       kSecClass: kSecClassGenericPassword
#   ] as CFDictionary

#   let status = SecItemAdd(keychainItemQuery, nil)
# }
# Листинг 2. Использование Keychain в iOS-приложении.

# 2. Небезопасное хранение данных (М2: Insecure Data Storage). 
# К категории относятся небезопасное хранение и непреднамеренные утечки данных.

# Возможные меры безопасности в Android-приложении:

# хранение информации в памяти устройства (RAM)
# использование EncryptedSharedPreferences, EncryptedDataStore
# {
#   val masterKey = MasterKey.Builder(this)
#   .setKeyScheme(MasterKey.KeyScheme.AES256_GCM)
#   .build()

#   EncryptedSharedPreferences.create(this, "myEncryptedPrefsFile", masterKey, PrefKeyEncryptionScheme.AES256_SIV, PrefValueEncryptionScheme.AES256_GCM).edit {
#       putString("mySecretKey", "mySecretValue")
#   }
# }
# Листинг 3. Использование EncryptedSharedPreferences в Android-приложении.

# Возможные меры безопасности в iOS-приложении:

# хранение информации в памяти устройства (RAM)
# использование Keychain, Encrypted RealmSwift, SQLCipher
# {
#   // Generate a random encryption key
#   var key = Data(count: 64)
#   _ = key.withUnsafeMutableBytes { (pointer: UnsafeMutableRawBufferPointer) in
#       SecRandomCopyBytes(kSecRandomDefault, 64, pointer.baseAddress!)
#   }
#   // Configure for an encrypted realm
#   var config = Realm.Configuration(encryptionKey: key)
#   do {
#       // Open the encrypted realm
#       let realm = try Realm(configuration: config)
#   } catch let error as NSError { }
# }
# Листинг 4. Использование Encrypted RealmSwift в iOS-приложении.

# 3. Небезопасная передача данных (М3: Insecure Communication). 
# Категория охватывает недостаточное подтверждение достоверности источников связи, 
# неверные версии SSL, недостаточную проверку согласования, передачу конфиденциальных 
# данных в открытом виде (cleartext) и т.д.

# Возможные меры защиты:

# серверная сторона должна использовать защищённое SSL/TLS соединение;
# запросы на сервер идут только через HTTPS протокол с действующим SSL сертификатом;
# использование SSL-Pinning в приложении;
# не использовать логирование запросов;
# при необходимости - шифрование передаваемых данных на стороне приложения.
# 4. Небезопасная аутентификация (М4: Insecure Authentication). Категория относится к аутентификации 
# конечного пользователя или неверному управлению сеансами.

# Возможные меры защиты:

# на устройстве не должны хранится пароли, данные кредитных карт и другие конфиденциальные данные;
# в приложении должно использоваться хэширование паролей или полное хэширование запросов с 
# созданием токена подписи запроса, если это нужно;
# сессия пользователя должна регулируется с помощью токена авторизации и токена обновления сессии, 
# которые выдаёт сервер.
# {
#   private fun attemptSignup() {
#       // hashing password
#       val hashedPassword: String = BCrypt.hashpw(password, BCrypt.gensalt())
#       val account: Account = Account(name, email, hashedPassword)
#   }
# }
# Листинг 5. Хэширование пароля в Android-приложении.

# class func passwordHash(from email: String, password: String) -> String {
#   let salt = "x4vV8bGgqqmQwgCoyXFQj+(o.nUNQhVP7ND"
#   return "\(password).\(email).\(salt)".sha256()
# }
# Листинг 6. Хэширование пароля в iOS-приложении.

# 5. Слабая криптостойкость (М5: Insufficient Cryptography). Категория описывает варианты 
# ненадлежащего использования криптографических элементов, слабой или недостаточной криптостойкости.

# Возможные меры защиты:

# на устройстве не должны хранится конфиденциальные данные;
# должны применяться известные криптографические стандарты, (например AES-CBC или AES-GCM с 256-bit 
# ключом);
# необходимо следовать рекомендациям NIST по используемым алгоритмам.
# В приложение должны внедряться проверенные криптографические библиотеки, например:

# Android: Jetpack Security, средства Java и Android (например, Cipher, SecretKey);
# iOS: CryptoSwift.
# 6. Небезопасная авторизация (М6: Insecure Authorization). Раскрытие информации пользователя, 
# которую злоумышленники могут получить с сервера.

# Возможные меры защиты:

# отключение подробного логирования ошибок на сервере (на продакшен);
# возвращать минимально нужный объем информации в ответах сервера;
# скрытие расположения любых конфиденциальных страниц на сервере, которые могут быть доступны через 
# Интернет;
# административные страницы или другие зоны ограниченного доступа должны скрываться из общего доступа 
# через Интернет.
# 7. Контроль содержимого клиентских приложений (М7: Client Code Quality). Категория рассматривает 
# контроль за входными данными.

# Возможные меры защиты:

# использование блоков контроля (private, public и тд) за исключением try/catch;
# контроль входящих параметров и имён файлов;
# не запрашивать ненужные для работы приложения разрешения;
# контроль за утечками памяти;
# обфускация кода;
# использование только проверенных библиотек от других разработчиков.
# 8. Модификация данных (М8: Code Tampering). Категория описывает изменение исполняемых файлов, 
# локальных ресурсов, перехват вызовов сторонних процессов, подмена runtime методов и динамическую 
# модификацию памяти.

# Возможные меры защиты в Android-приложениях:

# использования класса PackageManager для проверки подлинности подписи приложения;проверка имени пакета;
# обфускация с использованием ProGuardи т.д.
# Возможные меры защиты в iOS-приложениях:

# использование методов для обнаружения Jailbreak;
# обфускация кода с помощью SwiftShield и т.д.
# 9. Анализ исходного кода (М9: Reverse Engineering). Категория включает в себя анализ бинарных 
# файлов для определения исходного кода, библиотек, алгоритмов и т.д.

# Возможные меры защиты в Android-приложениях:

# проверка подписи приложения;
# проверка запущен ли root на устройстве (SafetyNet);
# обфускация кода.
# Возможные меры защиты в iOS-приложениях:

# использование Swift вместо Objective C;
# обфускация кода;
# обнаружение программ, сканирующих runtime, таких как Cycript and Frida.
# 10. Скрытый функционал (М10: Extraneous Functionality). Часто разработчики включают в код 
# приложений скрытые функциональные возможности, бэкдоры или другие механизмы, функциональность 
# которых предназначена для общего использования.

# Возможные меры защиты:

# код-ревью на протяжении всей разработки;
# проверка конфигурации приложения перед релизом;
# проверка отсутствия тестовых данных в релизных сборках;
# проверка точек входа на сервер;
# отключение излишнего логирования в релизных сборках.
# Соблюдение вышеуказанных рекомендаций поможет значительно повысить безопасность мобильных приложений.

# Для анализа защищенности, помимо вышеуказанных, используются подходы и методики следующих 
# мировых институтов и стандартов специализирующихся на обеспечении безопасности:

# Open Source Security Testing Methodology Manual («OSSTMM»);
# Technical Guide to Information Security Testing and Assessment (SP 800-115);
# ISACA IS auditing procedure «Security assessment-penetration testing and vulnerability analysis»;
# Penetration Testing Execution Standard («PTES»);
# A Penetration Testing Model («BSI»);
# Payment Card Industry («PCI») Data Security Standard («DSS») Guidance: PCI Information Supplement: 
# Penetration Testing Guidance;
# Federal Risk and Authorization Management Program («FedRAMP»): FedRAMP Penetration Test Guidance.
# Однако все работы по анализу защищенности мобильных приложений можно разделить на следующие этапы:

# 1. Сбор информации и первичный анализ стека технологий:

# Сбор первичной информации (предоставление дистрибутивов приложений и учётных данных, 
# IP-адресов тестируемых сервисов).
# Идентификация элементов инфраструктуры.
# Определение архитектуры и бизнес логики приложения.
# Определение доступного и скрытого контента.
# Определение критичных точек входа на ресурс.
# 2. Тестирование конфигурации:

# Тестирование конфигурации сервера.
# Тестирование конфигурации сервера.
# Проверка временных, резервных и неисполняемых файлов для поиска чувствительной информации.

# Тестирование конфигурации элементов информационного окружения и платформы бекэнда.
# Тестирование конфигурации мобильного приложения.
# 3. Тестирование системы аутентификации:

# Определение механизма аутентификации.
# Тестирование парольной политики.
# Тестирование процесса регистрации новых пользователей.
# Тестирование функции восстановления аккаунта и смены пароля.
# Проверка учетных данных по умолчанию.
# Тестирование на устойчивость к перебору имен пользователей.
# Тестирование на устойчивость к перебору паролей.
# Тестирование корректности работы механизма блокировок в случае перебора пароля.
# 4. Тестирование механизма управлениями сессиями:

# Анализ механизмов «Web-API» и «OAuth».
# Определение ролей пользователей.
# Проверка возможности повышения привилегий.
# Определение механизма управления сессиями.
# Проверка области действий cookies.
# Тестирование корректной работы механизма управления сессиями.
# 5. Тестирование защищённости транспортного уровня:

# Идентификация протоколов взаимодействия «клиент-сервер».
# Тестирование защищённости протоколов взаимодействия «клиент-сервер»

# 6. Проверка на корректность обработки передаваемых данных:

# Проверка всех данных, возвращаемых сервером и передаваемых клиентом.
# Тестирование на наличие SQL-инъекций.
# Тестирование на внедрение команд.
# Тестирование обхода каталогов.
# Тестирование неконтролируемого внедрение скриптов.
# Тестирование неконтролируемой загрузки файлов.
# Тестирование других вариантов инъекций (SMTP inj, SOAP inj, LDAP inj, XPath inj, Frame inj).
# Тестирование нативных программных недостатков.
# 7. Тестирование логики работы приложения:

# Проверка на возможность оказания влияния сторонними веб-приложениями.
# Проверка на наличие концептуальных уязвимостей, связанных с логикой работы веб-приложения и его 
# функциональными возможностями.
# 8. Формирование отчёта:

# Определение актуальных угроз информационной безопасности.
# Анализ влияния обнаруженных уязвимостей.
# Разработка рекомендаций по повышению уровня защищённости приложений и серверной части.
# Итак, резюмируем: мобильные устройства — привлекательная мишень для хакерских атак, 
# ведь в них хранятся и обрабатываются большие объемы личной информации и данные банковских карт.

# Хранение пользовательской информации в открытом виде, незащищенные данные на снимках состояния экрана, 
# ключи и пароли в исходном коде — это лишь немногие из тех недостатков, что открывают просторы для 
# проведения кибератак.

# Пользователи могут сами способствовать компрометации своих устройств: расширять стандартные 
# возможности смартфона, лишая его защиты, переходить по подозрительным ссылкам в SMS сообщениях, 
# загружать программы из неофициальных источников, поэтому безопасность пользовательских 
# данных — ответственность не только разработчиков приложений, но и самих владельцев мобильных устройств.

# Говоря о мобильных приложениях, нельзя недооценивать риск кибератаки в результате эксплуатации 
# серверных уязвимостей. Серверы мобильных приложений защищены не лучше, чем клиентские части.

# Риски связаны не только с брешами в защите клиента или сервера, но и с уязвимостями, которые 
# возникают в процессе клиент-серверного взаимодействия. Обмен данными по открытому протоколу 
# грозит полной компрометацией передаваемого трафика. Но даже защищенные соединения не всегда надежны, 
# что говорит об отсутствии у разработчиков глубокого понимания важности вопросов безопасности.

# Механизмы защиты являются слабым звеном мобильных приложений. Большинство уязвимостей были заложены 
# еще на этапе проектирования и стали следствием недостаточной проработки концепции защиты. 
# Рекомендуется тщательно прорабатывать вопросы безопасности мобильного приложения и регулярно 
# проводить тестирование его защищенности, начиная с самых ранних стадий жизненного цикла. 
# Наиболее эффективным методом проверки является метод белого ящика, при котором предполагается 
# наличие у эксперта доступа к исходному коду системы.

#         5.5G-технологии: 

# Развитие 5G-сетей открывает новые возможности для мобильных приложений, 

# включая более высокую скорость передачи данных и низкую задержку.

# Технология стандарта 5G существует уже некоторое время. Однако в этом году она
# стала на слуху. Технологические компании развернули масштабное внедрение 5G, и
# мы видим на рынке устройства, поддерживающие 5G. Кроме того, строится все
# больше мачт 5G, что позволяет использовать стандарт сети еще большему числу
# потребителей. По данным emarketer.com, в 2022 году до половины мобильных
# устройств будут иметь стандартный доступ к 5G. Ожидается, что 5G изменит
# способ разработки и использования приложений. Скорость и эффективность
# разработки значительно возрастут. В заключение следует отметить, что 5G
# улучшит приложения по целому ряду параметров, таких как скорость работы,
# лучшее качество прямых трансляций или предоставление разработчикам
# возможности вводить различные улучшения, не боясь потерять
# производительность приложения. Это также даст простор для свежих идей. Все
# ваши гениальные концепции приложений не пропадут даром. Вы сможете
# воплотить их в жизнь с помощью 5G. Мы с нетерпением ждем, что приготовит для
# нас эта технология, поскольку мы более чем уверены, что это главный тренд в
# области мобильных приложений в 2022 году.


#         6.Кросс-платформенная разработка: 

# Инструменты для кросс-платформенной разработки 

# позволяют создавать приложения, 

# которые работают на разных операционных системах, 

# уменьшая затраты на разработку.

# На протяжении многих лет кроссплатформенная мобильная разработка заслужила репутацию одного из 
# самых популярных направлений разработки программного обеспечения. Кроссплатформенный подход 
# позволяет создавать приложения для различных платформ с одной кодовой базой, что экономит 
# время и деньги и избавляет от ненужных усилий.

# Согласно исследованию Digital 2020 Reports, подготовленному компаниями We Are Social Inc. 
# и Hootsuite Inc., число пользователей интернета по всему миру увеличивается на 9 человек в секунду. 
# Это означает, что каждый день к мировому онлайн-сообществу присоединяется более 800 тысяч человек, 
# которые пользуются настольными или мобильными устройствами. Интересно, что последний вариант 
# становится все более популярным с каждым месяцем.

# Проникновение смартфонов в повседневную жизнь растет во всем мире. Ожидается, что к 2024 году 
# три из четырех используемых телефонов будут смартфонами. Согласно статистике StatCounter, 
# доля пользователей настольных устройств снизилась до 45,66%.

# image

# Самым простым объяснением такого состояния событий является изменение нашего образа жизни. 
# Мы проводим в интернете больше времени, чем когда-либо прежде. Почти каждый имеет доступ к 
# смартфону или планшету. Учитывая то, что среднестатистический пользователь в среднем проводит в 
# сети почти 7 часов в день, неудивительно, что более половины этого трафика поступает с 
# мобильных устройств.

# Это, в свою очередь, подталкивает к росту рынок мобильных приложений. Результатом предпочтения 
# мобильных приложений являются довольно внушительные цифры. Согласно отчету Statista за прошлый год, 
# мировые доходы от мобильных приложений в 2019 году составили 461 млрд долл., а к 2023 году платные 
# загрузки и реклама в приложениях, как предполагается, принесут более 935 млрд долл. дохода.

# Выбор пути мобильной разработки

# Приложения популярны не только среди современных пользователей интернета, но и достаточно 
# прибыльны для их владельцев. Если связать эти два фактора воедино, можно сделать вывод, 
# что практически любая стратегия развития бизнеса может включать создание приложения. 
# Дилемма, однако, заключается в выборе правильного пути разработки мобильных приложений.

# Одним из первых шагов на пути к цифровому успеху является решение о мобильной операционной 
# системе – это, кстати, было не так просто десять лет назад, когда Android, iOS, Microsoft, 
# RIM и Symbian были вполне жизнеспособными вариантами.

# Сегодня выбор гораздо проще, поскольку единственными крупными игроками остаются Android и iOS, 
# которые вместе составляют около 99% от общей доли рынка мобильных операционных систем.
# Согласно различным статистическим данным, Android выигрывает по количеству пользователей, 
# но нет недостатка и в сторонниках iOS, доля которого на рынке составляет 25,75%. 
# В то время как Google Play Store может похвастаться большим количеством приложений (2,5 млн), 
# Apple App Store содержит более 1.8 млн приложений. Одного этого факта достаточно, чтобы показать, 
# что ни одну из двух платформ не следует упускать из виду.

# image

# Поскольку выбор мобильной операционной системы является вопросом личных предпочтений пользователей, 
# а не вопросом производительности или доступности, будет целесообразно в конечном итоге создать 
# мобильное приложение как для Android, так и для iOS – и есть три способа сделать это.

# Отдельные нативные приложения для Android и iOS

# Нативное решение, как следует из названия, предполагает разработку приложения на родном 
# для данной платформы языке программирования: Java или Kotlin для Android, Objective-C или Swift 
# для iOS. Будучи глубоко ориентированной на операционную систему, разработка нативных приложений 
# имеет свои достоинства и недостатки. С одной стороны, нативное решение обеспечивает доступ ко 
# всем функциям данной ОС, позволяет неограниченно настраивать интерфейс и предотвращает любые 
# проблемы с производительностью. С другой стороны, если вы хотите охватить оба типа пользователей, 
# вам придется создать два отдельных приложения, которые требуют больше времени, денег и усилий.

# Прогрессивное веб-приложение

# Прогрессивное веб-приложение – технология в веб-разработке, которая добавляет сайтам возможности 
# приложений для мобильных устройств и трансформирует сайт в приложение. На выходе получаем гибрид 
# сайта и приложения для мобильных устройств. Однако, как любой другой вариант, прогрессивные 
# веб-приложения небезупречны, так как они потребляют больше энергии батареи и не могут получить 
# доступ ко всем функциям данного устройства, например, к календарю, камере, контактам и так далее. 
# Кроме этого, теряется возможность перекрестного входа в веб-приложение с помощью приложения Facebook, 
# Инстаграм, Вконтакте или т.д. Несмотря на то что веб-приложение не требует установки из 
# Google Play Store или Apple App Store, последние выполняют функцию крайне удобных 
# библиотек для пользователей.

# Одно кроссплатформенное приложение для двух систем

# Кроссплатформенность – это способность ПО (в нашем случае мобильных приложений) 
# работать на нескольких платформах.

# Кроссплатформенная мобильная разработка позволяет охватить две операционные системы, iOS и Android, 
# одним кодом. Она не предполагает написания кода на родном языке программирования, однако обеспечивает 
# почти нативный опыт благодаря интерфейсу визуализации с использованием собственных элементов 
# управления.

# На текущий момент многие компании используют кроссплатформенные решения, кто-то уже всерьез 
# подумывает перейти на них в ближайшем будущем. Это не только вендоры самих решений, как, например, 
# Facebook со своим React Native, на котором работают приложения Facebook и Instagram, но и другие 
# крупные игроки рынка, у которых имеются продукты, например, на Flutter – Alibaba, Philips Hue, 
# Hamilton, Tencent, Grab, Groupon и другие.

# Существует множество статей, где подробно анализируются все преимущества 
# кроссплатформенных приложений. Однако плюсы и минусы стоит рассматривать на платформе, 
# которая имеет все шансы стать в 2020 году самой популярной среди разработчиков – Flutter.

# Flutter

# Flutter – SDK от компании Google с открытым исходным кодом для создания кроссплатформенных 
# мобильных приложений, который предоставляет пользователям как Android, так и iOS по-настоящему 
# нативный дизайн и опыт. Данная платформа разработки уже на старте показала внушительный рост по 
# сравнению с React Native. Анонсированный на конференции Google I/O 2017 и выпущенный в 2018 году, 
# Flutter остается все еще новичком на рынке платформ для создания кроссплатформенных приложений. 
# С более чем 87 700 звездами в GitHub, что выше результата React Native, и подавляющим 
# большинством разработчиков, называющих его одним из трех самых любимых фреймворков в обзоре 
# Stack Overflow’s annual Developer Survey 2019, Flutter, несомненно, является силой, 
# с которой следует считаться.

# image

# Рассмотрим плюсы и минусы Flutter как платформы для разработки продукта:

# Плюсы

# короткий time-to-market;
# производительность приложений наравне с нативными решениями;
# общая стоимость разработки ниже аналогичного решения с нативными приложениями;
# поддержка единой кодовой базы;
# снижение затрат на исправление багов и добавление новой функциональности.

# Минусы

# некоторую функциональность необходимо разрабатывать независимо на обеих платформах, 
# если нет кроссплатформенных библиотек;
# один язык разработки – Dart, который необходимо выучить, если компания разрабатывает приложение, 
# не имея необходимой экспертизы. В нашей компании есть разработчики на Flutter, что нейтрализует 
# данный минус и позволяет получить специалистов быстрее поиска на рынке (согласно исследованиям, 
# на найм специалиста тратится не менее двух недель).

# Язык программирования Dart, который Google называет “оптимизированным под клиента”, 
# был представлен в 2011 году. Это адаптивный объектно-ориентированный язык, который считается 
# относительно легким для изучения по двум причинам: во-первых, он использует C/C++ и Java; во-вторых, 
# на официальном сайте Dart можно найти обширную и довольно простую документацию. Также стоит отметить, 
# что Dart поставляется с большим хранилищем Flutter-совместимых программных пакетов, позволяющих 
# сделать ваше приложение еще более сложным.

# Кроссплатформенные приложения на Flutter разрабатываются аналогично нативным 
# в общепринятых IDE – Android Studio и XCode. Как дополнение, разработчикам доступен hot-reload кода, 
# что ускоряет запуск приложения во время разработки. Кроме этого, процесс публикации ничем не 
# от нативных – собранные дистрибутивы подписываются и загружаются в магазины приложений.

# Польза для бизнеса

# В бизнесе решающую роль зачастую играет метрика TTM (time-to-market). Быть впереди и внедрять 
# новые функции в свой продукт быстрее конкурентов сразу на обеих платформах – об этом с 
# самого начала задумывается любая компания-лидер. Кроссплатформенные фреймворки позволяют 
# это достигать и, как очевидный бонус, получать снижение затрат на разработку на каждом этапе. 
# По нашим подсчетам – разработка на Flutter позволяет снижать общую стоимость разработки 
# продукта на 25-30%.

# Прогноз, перспективы на ближайшие 5 лет

# Все, кому важен быстрый выход на рынок со своим продуктом одновременно на обеих платформах 
# мобильной разработки, уже активно разрабатывают с использованием кроссплатформенных решений. 
# В 2020 году тренд не изменится, и все больше компаний будут использовать кроссплатформенные 
# мобильные приложения на Flutter.

# Google разрабатывает новую ОС Fuchsia, в том числе для мобильных устройств. 
# Flutter заявлен как UI toolkit в этой ОС. В ближайшем будущем Fuchsia может заменить 
# ОС Android, и, несмотря на то что в Fuchsia в данный момент все же добавляется 
# возможность запускать нативные приложения под Android, стоит учитывать эту тенденцию 
# при планировании разработки и выхода на рынок со своими мобильными приложениями.

# Таким образом, одна кодовая база, несомненно, влияет на все аспекты разработки приложения 
# вплоть до снижения количества требуемых разработчиков, позволяя компании сэкономить деньги, 
# которые обычно затрачиваются на исправление и обновление двух отдельных кодовых баз. 
# Сэкономленную значительную часть первоначального бюджета проекта можно затратить на 
# дальнейшее совершенствование приложения в соответствии с отзывами пользователей. 
# В результате кроссплатформенная разработка мобильных приложений сбалансированно 
# достигает своих целей как по критерию цены, так и по критериям времени, сложности и 
# пользовательского опыта.

#          7.Экологические и социальные вопросы: 

# Приоритет устойчивости и социальной ответственности 

# приводит к созданию мобильных приложений, 

# которые решают экологические и социальные проблемы.

# Сегодняшнее потребление построено на принципах удобства и мобильности — онлайн-заказы, 
# доставка курьером до двери, подача заявок или жалоб в сети, регистрация на мероприятия онлайн, 
# да и сами мероприятия тоже перешли в интернет. 


# Чтобы сделать все процессы еще удобнее, производители и продавцы перешли в наши телефоны в 
# виде приложений, а еще максимально персонализировали сервисы под запросы аудитории за счет 
# нейросетей и AI, получив доступ к соцсетям пользователя, геолокации и т.д.


# Как ни крути, мы проводим в приложениях очень много времени. Поэтому компании, которые хотят, 
# чтобы потребители задумались об экологичности и ответственном потреблении, как это ни парадоксально, 
# тоже перешли в приложения. 


# Максим Голованов, руководитель проекта +1Город, отобрал 15 экоприложений на свой вкус, 
# которые помогут сэкономить ресурсы планеты, разобраться в вопросе пластика и раздельного 
# сбора мусора, перестать покупать и выбрасывать лишнее — и в итоге заработать. 

# Содержание.

# Ответственное потребление
# Раздельный сбор мусора
# Совместное потребление
# Ответственное потребление
 

# Ecolabel Guide

# App Store

# Google Play

# Приложение создано для покупателей, которые хотят разобраться в экомаркировках продукции. 
# В базе представлено 56 маркировок, включая как распространенные маркировки Евросоюза, 
# такие как ECOCERT, так и локальные экомаркировки Тайваня, Сингапура, Канады или Японии. 

# Для удобства поиска маркировки с упаковки воспользуйтесь сканером в приложении, 
# он распознает знак и откроет его в базе вместе с подробным описанием значения маркировки. 
# Например, значок EAC, который мы чаще всего видим на упаковке, — не экомаркировка, 
# а знак технического соответствия продукции регламенту Таможенного союза, он тоже есть 
# в базе приложения.

# Плюсы: Экоприложением пользоваться просто и первое время очень интересно. 
# Доступно на русском языке.

# Минусы: После нескольких походов в магазин уже запоминаешь самые распространенные 
# маркировки — и необходимость в приложении отпадает.

# Экомаркировка

# «Дзен-мани»
# App Store

# Google Play

# Приложение для учета расходов и доходов: анализирует расходы за месяц, планирует их исходя 
# из текущего баланса и ежемесячных поступлений, показывает самые большие траты по дням и категориям.

# Чтобы получать наиболее детальные сведения, разработчики советуют дать приложению доступ 
# к данным из приложения вашего банка (система уверяет, что это безопасно — данные шифруются 
# с помощью протокола SSL/TLS). Но есть и второй вариант — разрешить приложению собирать данные 
# из SMS банков. 

# Плюсы: Приложением можно пользоваться бесплатно с базовым набором функций или с расширенным 
# за 149 рублей в месяц. Доступно на русском языке.

# Минусы: Требуется вникать в графики и таблички, чтобы разобраться.

# Дзен-мани

# Veggie Go
# App Store 

# Google Play

# В приложение входят карта веганских ресторанов и кафе «по всему миру», а также подборка веганских 
# рецептов. Наверняка на карте доступны и не все города мира, но столицы точно есть — проверено! 
# Также пользователи могут добавлять свои любимые веганские места, если их нет на карте. 

# Приложение просит зарегистрироваться и указать свой веганский стаж, а потом — подписаться на 
# других пользователей. 

# Плюсы: Приложением можно пользоваться бесплатно или подписаться на автоматический донат в 
# размере 99 рублей в месяц (или 990 рублей в год). Доступно на русском языке.

# Минусы: Несмотря на наличие карты, приложение больше похоже на соцсеть, где пользователи могут 
# выкладывать в ленту рецепты и фотографии веганской еды.

# Вегги-Го
 
# «Кошелек»
# App Store

# Google Play

# Приложение для хранения карт лояльности магазинов, чтобы не носить карты с собой или сразу 
# отказаться от пластика в момент оформления. Загрузить карту можно с помощью фото или сканирования 
# штрихкода. Недавно в приложении добавилась функция «Кошелек Pay», с помощью которой, привязав 
# банковскую карту, можно оплачивать покупки бесконтактно через NFC.

# Плюсы: Проект выступает за отказ от пластиковых карт, поэтому принимает их на переработку 
# в магазинах «ВкусВилл», «Лента», «Мега», через экоцентры «Собиратора». Доступно на русском языке.

# Минусы: С учетом того, что большинство магазинов уже отказались от пластиковых карт и 
# привязали виртуальные к номерам телефонов пользователей, «Кошелек» уже не столь актуален, 
# как на заре карточного бума. А бесконтактная оплата через NFC доступна и в Google Pay.

 

# Кошелек
 

# 4fresh
# App Store

# Google Play

# Онлайн-магазин товаров для здорового образа жизни, веганских продуктов и товаров от экологичных 
# локальных брендов. Можно найти большинство российских брендов косметики и бытовой химии с 
# безопасным для экологии составом, продукты питания длительного хранения и гастроном с молочными 
# продуктами, фруктами и овощами, а также небольшую кухонную технику. 

# Плюсы: Часто можно увидеть скидки и акции на отдельные группы товаров или бренды, в том числе 
# специальные наборы товаров для начинающего экологиста. Помимо каталога товаров, в приложении 
# есть полезные статьи о том, как ухаживать за собой, и последние номера электронной версии 
# журнала 4fresh Guide. 

# Доставка возможна курьером по Москве или в пункты выдачи в города России, Казахстана и Беларуси. 
# Качественная российская замена американскому iHerb. Доступно на русском языке.

# Минусы: Доставка осуществляется со склада в Одинцово в течение нескольких дней.

# 4fresh

# +1Город
# App Store 

# Google Play

# Приложение поможет найти доступные социальные и экологические сервисы, например, 
# экоцентры и пункты приема вторсырья, фандоматы для сбора ненужной одежды и обуви, 
# секонд-хенды и винтажные магазины, волонтерские акции, магазины товаров без упаковки, 
# кофейни и рестораны со скидками на напитки и еду в свою тару и другие. Всего более 100 тыс. 
# точек в 1275 населенных пунктах России. 

# Новые категории, в том числе социальные — такие как кризисные центры для женщин, 
# пострадавших от насилия, — добавляются ежемесячно, поэтому имеет смысл периодически обновлять 
# приложение, чтобы видеть актуальные данные.

# Плюсы: Пользователи сами могут добавлять на карту полезные сервисы и зарабатывать баллы в системе 
# лояльности +1Город, выполняя экозадания. Баллы затем можно обменять на реальные подарки и скидки 
# от партнеров проекта. Доступно на русском языке.

# Минусы: из-за большого объема данных загрузка карты может занять какое-то время.

# Плюс один город
 
# Joulebug
# App Store

# Google Play

# Приложение помогает внедрять полезные и экологичные привычки, такие как экономия ресурсов, 
# сортировка отходов, отказ от перепотребления и т.д. Для использования необходима регистрация. 
# Выполняя задания в экоприложении, например, использовать энергосберегающие лампы, можно сразу 
# увидеть, сколько было сэкономлено воды, CO2, переработано отходов благодаря вашим действиям.

# Плюсы: За каждое выполненное задание или за участие в соревнованиях пользователь получает баллы. 
# Успехами можно поделиться с друзьями в соцсетях. 

# Минусы: Доступно только на английском языке.

# Joulebug
 
# No Waste
# App Store

# Google Play

# Приложение помогает следить за тем, какие продукты есть в холодильнике, морозилке, кладовой, 
# не выбрасывать лишнюю еду и за счет этого экономить. 

# Минусы: Сканер не распознает российские продукты, поэтому все сроки годности нужно вбивать вручную. 
# Необходима регистрация. Недоступно на русском языке.

# Плюсы: В приложении для экологии удобно следить за истечением срока годности продуктов, 
# составив список продуктов из холодильника. Из вашего списка приложение выделит те продукты, 
# при производстве которых в атмосферу выбрасывается много СО2. Есть обучающее видео по 
# использованию приложения.

# Nowaste

# «Плюшки»
# App Store

# Google Play

# Приложение — электронный кошелек для карт лояльности магазинов и других сервисов, конкурент 
# «Кошелька».

# При добавлении новой карты выдает большой список магазинов, чьи карты можно добавить по названию 
# магазина. В приложении есть отдельный раздел со скидками по категориям — украшения, одежда, обувь, 
# маркетплейсы и т.д.

# Плюсы: Доступно использование приложения без регистрации в гостевом режиме. Можно поделиться 
# скидочной картой с другом из списка контактов, если у него тоже установлено приложение. 
# Доступно на русском языке.

# Минусы: Большинство магазинов перешли на виртуальные карты, привязанные к номеру телефона, 
# поэтому скачивать отдельное приложение для хранения карт лояльности не обязательно.

# Плюшки
# Раздельный сбор мусора
 
# Eatme

# App Store

# Google Play

# Приложение доступно в девяти городах России и Ташкенте. 

# Помогает находить кафе и рестораны, которые готовы продать пользователям еду с истекающим сроком 
# годности со скидкой — ежедневно рестораны вынуждены выбрасывать килограммы еды с коротким сроком 
# годности, особенно хлеб и выпечку или продукты, в составе которых есть соусы, например, сэндвичи. 
# Это приводит к образованию гигантского количества органических отходов, которые в России не 
# перерабатываются, а попадают на полигон, где, разлагаясь, выделяют в атмосферу метан. 

# В разделе «Акции» можно увидеть доступные предложения, а в разделе «Карта» — посмотреть заведения, 
# подключенные к системе EatMe. 

# Плюсы: С помощью EatMe рестораны могу не выбрасывать еду, а продавать ее, а покупатели — экономить. 
# Доступно на русском языке.

# Минусы: Акции есть не всегда.

# EatMe

# TrashBack
# App Store

# Google Play

# Приложение для экологии призвано помочь горожанам определить показатели, отвечающие за 
# качество жизни, такие как чистота воздуха, уровень шума, а также мотивировать сортировать 
# отходы и сдавать их на переработку. Для сортировки отходов в приложении разработана система 
# заданий, выполняя которые — например, собирая мусор в городских парках и лесопарках — можно 
# зарабатывать баллы в системе лояльности.

# Плюсы: В приложении есть «Карта качества воздуха», которая по фото должна отслеживать наличие в 
# воздухе крупных частиц, а также функция «Замер уровня шума, дб», реагирующая на окружающий шум 
# и указывающая его уровень. 

# Приложение связано с системой лояльности «ВкусВилл», а значит, накопленные баллы можно потратить 
# в магазинах этой сети. 

# Также имеется справочник кодов для переработки и камера распознавания видов вторсырья, но данные 
# актуальны не для всех фракций. Доступно на русском языке.

# Минусы: В разделе «Замер уровня шума» показатели уровня шума сильно завышены, так как шепот система
# оценивает в 80 дБ, что равно шуму от магистрали. Карта качества воздуха не подгружается. 
# Недоступна функция оплаты ЖКУ баллами в городах кроме Реутова. 

# Не все фракции определяются сканером верно — камера распознает прозрачный глянцевый пластик 
# как стекло, а коричневый пластик как алюминий. Нет раздела с описанием работы приложения и 
# доступных функций.

# Thrashback

# Cовместное потребление
 
# AWorld
# App Store

# Google Play

# Экоприложение было создано в поддержку кампании ООН — ActNow («Действуй сейчас»), 
# цель которой — рассказать людям об индивидуальной ответственности каждого в области 
# изменений климата и достижения целей устойчивого развития. 

# Плюсы: Несмотря на серьезную миссию, приложение построено на игровой механике — читай статьи об 
# экологии, принимай участие в вебинарах, участвуй в экологических челленджах, выполняй задания. 
# Например, предлагается снизить температуру нагрева батарей, чтобы тратить меньше электричества, 
# или сократить потребление мяса и добавить больше растительной пищи в рацион, перемещаться на 
# поезде вместо самолета или покупать больше локальных товаров вместо импортных. 
# Своими успехами разработчики предлагают делиться с друзьями в соцсетях.

# Минусы: Доступно только на английском языке.

# Aworld
 
# EWG Healthy Living

# App Store

# Google Play

# Приложение, которое позволяет по штрихкоду на упаковке товара узнать, насколько он безопасен 
# или вреден для вас и окружающей среды. Товары делятся на категории: зеленую (безвредно), 
# желтую (ограниченный вред) и красную (вреден), а также по степени опасности от 1 до 10 баллов. 
# Например, средства для кожи для защиты от солнца, содержащие масла, относятся к товарам желтой 
# категории, так как масла не разлагаются в воде, а отбеливатели для стирки большинства брендов 
# попадают в красную категорию повышенной опасности, так как имеют высокоаллергенный состав и 
# содержат микропластик, то есть вредны и для человека и для природы. 

# Минусы: Увы, российские штрихкоды не считываются системой, в базе также нет российских товаров.

# Плюсы: Есть большинство товаров иностранных производителей, например, парфюмерия и средства для 
# уборки известных брендов. Если штрихкод не считывается, найти товары можно в поиске приложения.

 
# EWGHL
 
# OhmPlug от OhmConnect

# App Store

# Google Play

# Американское приложение, запущенное компанией OhmConnect, помогает пользователям снижать расход 
# электричества дома или в офисе в часы наибольшей загрузки теплоэлектростанций. Сэкономленные 
# Ватты можно конвертировать во внутреннюю валюту приложения и обменять на подарки, передать на 
# благотворительность или получить наличными.

# Плюсы: Механика конвертации сэкономленной энергии в реальные ценности.

# Минусы: Приложение может синхронизироваться только с умными адаптерами, подключенными к Wi-Fi, а 
# значит, необходимо докупить дополнительную технику. Доступно только на английском языке.

 

# OhmPlug
 
# Fon

# App Store

# Google Play

# Fon — международная сеть Wi-Fi. С помощью приложения можно подключиться к более 
# чем 20 млн Wi-Fi-точек, купив абонемент на срок от часа до 30 дней. Чтобы найти 
# ближайшую точку с Wi-Fi Fon в своем регионе, используйте карту в приложении. 

# Плюсы: Приложение будет полезно для путешественников, хотя приобрести местную или международную 
# сим-карту с интернетом может в итоге оказаться дешевле.

# Минусы: Разработчики пишут, что точки есть по всему миру, но на деле только страны ЕС,
# ЮАР, США, Япония, Тайвань, Бразилия и Австралия полностью покрыты сетью Fon. 
# В остальных странах сервис представлен точечно, а абонементы бывают недоступны. 
# Приложение только на английском языке.

#           8.Финансовые технологии (FinTech): 

# Рост популярности мобильных банковских приложений, 

# платежных систем и криптовалютных кошельков.

#          9.Забота о здоровье и фитнесе: 

# Мобильные приложения для здоровья и фитнеса остаются востребованными, 

# предоставляя функции мониторинга здоровья, 

# фитнес-трекинга и дистанционной медицинской помощи.

#          10.Обновления в интерфейсах: 

# Улучшения интерфейсов, включая жесты, голосовые команды и элементы 

# дополненной реальности, улучшают пользовательский опыт.

# Эти тенденции формируют будущее мобильных приложений, и разработчики 

# должны учитывать их при создании новых приложений и обновлении существующих.