             #   1.Обоснование выбора темы
             
# Развитие мобильных технологий привело к фундаментальным изменениям в нашем обществе.
 
# Мобильные приложения стали неотъемлемой частью повседневной жизни, 

# обеспечивая пользователей уникальными возможностями в области коммуникации, 

# развлечений, образования и работы. 

# Растущее влияние мобильных приложений на наш образ жизни и бизнес 

# сделало их разработку и оптимизацию критически важными.

# Выбор темы "Разработка мобильного приложения" обусловлен следующими причинами:

                # 1.Актуальность и повседневное применение: 

# Сегодня сложно переоценить роль мобильного телефона в жизни человека. С помощью этого компактного 
# устройства мы в любой момент можем быстро связаться со своими близкими и коллегами по работе, 
# чтобы узнать интересующую нас информацию. В списке контактов могут одновременно храниться тысячи 
# номеров и человек с лёгкостью может быстрой найти нужный в несколько нажатий. 
# Также на мобильных устройствах, помимо контактов может храниться и другая информация, различные файлы, 
# данные о кредитных картах и мультимедиа. [2]
# Люди очень много времени проводят, именно за своим смартфоном, причём даже когда он не используется 
# продолжается его работа. Телефон важен в повседневной жизни. Самыми распространенными платформами 
# являются:
# Android – бюджетная и самая распространённая сейчас.
# IOS – очень проста в использовании, не из дешёвых.
# Windows Mobile – телефоны на основе Windows, многосторонняя, достаточно много функций.
# Мобильные устройство — это любое небольшое устройство, которое обычно содержит дисплей и миниатюрную 
# клавиатуру (позже был изобретён сенсорный экран с виртуальной клавиатурой). 
# Первоначально это были в основном карманные устройства, но разнообразие таких устройств постоянно 
# увеличивается. Устройства становятся более гибкими и могут выполнять различные функции, 
# такие как запись и воспроизведение мультимедиа, подключение к видеочатам, подключение к Интернету, 
# функции оплаты.
# Мобильное приложение – программное обеспечение, предназначенное для работы на смартфонах, планшетах 
# и других мобильных устройствах, разработанное для конкретной платформы. [4]
# Первоначально мобильные приложения использовались для быстрой проверки электронной почты, но их 
# высокий спрос привел к расширению их назначений и в других областях, таких как игры для мобильных 
# телефонов и GPS, общение, просмотр видео и пользование интернетом.
# На сегодняшний день мобильные приложения выполняют массу задач в различных сферах нашей жизни. 
# С их помощью, человек обретает гораздо больше возможностей, например, в области бизнеса. 
# Сложно представить хотя бы немного крупную компанию, не имеющую своего собственного мобильного 
# приложения. Причём данные приложения могут выполнять сразу несколько профессиональных функций.
# Существует, также, множество различных приложений, которые требует интернет – соединение, 
# так как популярность мобильного интернета растёт стремительными темпами. 
# В 2012 году пользователь в среднем проводил в мобильном интернете 74 минуты в день, но на 
# сегодняшний день это время может превышать 5 часов. [1]
# Большинство обладателей современных смартфонов имеют целый список установленных на их устройстве 
# приложений. В основном их используют как элемент досуга, например, для общения или получения новой 
# актуальной информации. Но существуют и деловые приложения, к примеру приложения для финансовых 
# учреждений и банков с их помощью можно обменивать валюту, торговать недвижимостью и 
# заниматься онлайн – продажами.
# Для того, чтобы разделять приложения по их техническим характеристикам существуют выделенные категории. 
# Разделение происходит, исходя из того, для какой целевой аудитории разрабатывалось мобильное приложения.
# Наиболее востребованные категории можно разделить по исполняемым функциям:
# развлечения (игровые приложения, мультимедиа, музыка, заказ билетов онлайн);
# путешествия (заказ отеля, аренда авто, услуги гида, сервис онлайн – переводчика;
# бизнес (финансовые приложения, планирование, торговля, приложения для города, поиск работы);
# социальные приложения (социальные сети, глобальные брендированные сети, специализированные сети);
# еда (заказ и доставка еды, геолокация заведений питания);
# спорт (спортивные новости, покупка билетов на спортивные мероприятия, игровые симуляторы);
# образование (обучающие программы, интерактивные курсы);
# новости (дайджесты, рейтинги);
# стиль жизни (кулинарные приложения, планирование отпуска, рукоделие). 

#              2.Рост рынка мобильных приложений: 

# Рынок мобильных приложений постоянно расширяется, 

# предоставляя новые возможности для инноваций и предпринимательства. 

# Понимание процесса разработки и успешного внедрения мобильных приложений 

# становится ключевым фактором для успешного предпринимательства и конкурентоспособности.

#                           Общие показатели:

# Сегодня использование приложений находится на рекордно высоком уровне. В 2022 году пользователи 
# скачали на 11% больше приложений, чем в 2021, а среднее время, проведенное в мобильных приложениях, 
# увеличилось на 3% и составило 5 часов в день. В то же время, пользователи все неохотнее тратят 
# деньги в приложениях (-2% по сравнению с 2021 годом). В основном это коснулось игр и почти не 
# затронуло приложения, которые предоставляют более необходимые функции и услуги.
# Зато широкая аудитория приложений, качественный таргетинг и другие преимущества in-app рекламы 
# привлекают все больше рекламодатели, что показывает рост расходов на рекламу в приложениях 
# в 2022 году на14%. По всем прогнозам, этот показатель продолжит расти и в этом году. 
# Это говорит о том, что при составлении стратегии монетизации своего приложения в первую очередь 
# стоит рассчитывать на доход от размещения рекламы.
# Gaming
# Спрос на игры находится на рекордно высоком уровне.
# По сравнению с 2021 годом в 2022 было скачано на 6,5 миллиардов больше игр, таким образом, 
# количество скачиваний составило почти 90 миллиардов.
# Однако расходы на внутриигровые покупки снизились на довольно существенные 5%.
# Лидером по пользовательским расходам по прежнему является категория RPG игр.
# На эту категорию приходится 31% от всех внутриигровых расходов. Но по количеству скачиваний эта 
# категория находится в конце списка, составляя только 3% от общего количества загрузок.
# На втором и третьем месте по пользовательским расходам расположились категории Strategy и Match, 
# на которые приходятся 15% и 11% внутриигровых расходов соответственно.
# Стоит заметить, что эти три категории, хоть и занимают лидирующие позиции, но в 2022 показали 
# снижение внутриигровых расходов: RPG на 8,3%, Strategy на 6,6%, Match на 5,4%.
# Единственная категория игр в которой потребительские расходы значительно выросли – Action игры +20,6%, 
# а лучшей игрой в этой категории является Honor of Kings – именно она принесла больше всего доходов 
# от игроков.
# По количеству загрузок лидирую категории Hypercasual – 29%, Simulation – 17% и Action – 11%.
# По количеству игровых часов лидирует категория Simulation, а точнее ее подкатегория 
# Creative Sandbox games с такими играми как Roblox и Minecraft. Время, проведенное в них, 
# выросло на 25% относительно 2021 года.
# Худшими по этому показателю оказались Shooting (Battle Royale) игры – количество затраченного 
# времени сократилось примерно на 20% по всему миру. Хотя в некоторых регионах время проведенное 
# в играх данной категории показало значительный рост в 2022 году: в Китае на 15%, а в Саудовской 
# Аравии на 45%.
# Finance
# Начавшееся в 2020 году активное продвижение финансовых приложений продолжило свой стремительный 
# рост в 2022. Мобильные банки, а также электронные кошельки и платежи набирают 
# популярность во всем мире. Так, из Топ-10 финтех приложений по количеству скачиваний в мире, 
# 6 приложений относятся к категории Digital Wallets & Payment.
# Экономические проблемы, такие как высокая инфляция, обуславливают процветание приложений 
# персонального кредитования в Северной Америке, Азии и Африке.
# После потрясений на криптовалютном рынке в 2022 можно было наблюдать заметный спад количества 
# скачиваний приложений для торговли криптовалютой.
# В отличие от других экономических приложений, финтех остается сильно локализованным, ведь здесь 
# особенно важно знание местного рынка, финансовых правил и норм. Особенно это заметно в 
# странах Азиатско-Тихоокеанского региона (APAC). Так, например, в Китае более 99% загрузок 
# финансовых ресурсов приходится на долю местных издателей.
# Продолжают свое активное развитие необанки. Хотя количество пользователей традиционных банков 
# все еще превышает количество пользователей необанков, в некоторых регионах, например в Великобритании, 
# необанкам удалось существенно сократить этот разрыв. В США компании предоставляющие банковские 
# услуги только в цифровом формате пока не сумели повторить успех Великобритании, но, в любом случае, 
# конкуренция со стороны необанков стимулировала традиционные банки на улучшение своих сайтов и 
# мобильных приложений. Это вызвало рост активных пользователей и увеличение проведенного времени в 
# большинства мобильных банковских приложениях.
# Еще одна значимая тенденция финтех рынка США 2022 года – увеличение количества загрузок Cash Advance 
# приложений. В последние годы такой тип приложений стал обычным явлением для США. 
# Это связывают с высоким уровнем инфляции. Но в 2022 году количество скачиваний резко возросло, 
# увеличившись на 44% по сравнению с 2021 годом.
# Retail
# Начавшийся во время пандемии стремительный рост покупок через мобильные приложения продолжается, 
# но его темпы замедлились.
# Время проведенное в приложениях для шопинга в 2022 году увеличилось на 9%, в то время как 
# в 2021 году этот показатель составил 19%.
# Сегодня наиболее растущими рынками мобильных приложений для покупок являются развивающиеся 
# рынки Азиатско-Тихоокеанского региона – Индия и Индонезия, а также страны Латинской Америки, 
# включая Бразилию, Мексику и Аргентину.
# Изменились мотивы покупателей. Во время пандемии покупатели совершали покупки в мобильных приложениях, 
# чтобы избежать личного присутствия и контакта. Сейчас очные покупки вернулись, но из-за высокой 
# инфляции покупатели идут в мобильные приложения в надежде сэкономить. Об этом также свидетельствует 
# увеличение в 2022 году на 27% количества скачиваний приложений для купонов и вознаграждений.
# Video Streaming
# Эксклюзивный спортивный контент служит важнейшим этапом для привлечения новых пользователей. 
# Добавление освещения крупных спортивных событий хотя и дорогостоящий, но высокоэффективный способ 
# привлечения новых пользователей потоковых видеосервисов.
# Неспортивный контент, который вызвал наибольший всплеск скачиваний приложений – "Эйфория" (HBO Max), 
# "Хэллоуин заканчивается” (Peacock TV) и "Дом дракона" (HBO Max).
# TikTok стал вторым не игровым приложением, в котором потребительские расходы превысили $6 миллиардов 
# долларов за все время, и значительно превзошел успех других развлекательных приложений.

#                         3.Образовательные цели: 

# Исследование процесса разработки мобильных приложений 
# предоставляет уникальную возможность углубленного изучения 
# современных технологий программирования, дизайна и тестирования, 
# что важно для моего профессионального и личностного развития.
# Современные тенденции, связанные с информатизацией и цифровизацией социальной и профессиональной 
# сфер нашли отражение в образовательной плоскости и направляют педагогическую науку на глубокое 
# осмысление воздействий на познавательные, визуальные, деятельностные и иные сферы личности обучаемого. 
# Использование мобильных контентов в социальной сфере привело педагогическому анализу возможностей 
# их применения в образовательной практике, в том числе, в учреждениях высшего образования с двух 
# направлений – как мобильного обучения, как вида обучения, так, и как использования мобильных 
# приложений в качестве не только средств получения информации, но и средств обучения и контроля.

# В современной педагогической науке педагогический анализ мобильного образования нашёл отражение в 
# трудах ряда ученых: с точки зрения перспектив применения в системе дистанционного обучения [1], 
# с точки зрения SMS-тестирования [8], как реализация принципа мобильного обучения или обучения в 
# любом удобном месте и в любое удобное время [6], как фактор профессиональной мобильности [10] и др.

# Рядом исследователей показана реализация дидактических функций посредством применения в 
# образовательном процессе мобильных приложений:

# познавательная, направленная на удовлетворение интеллектуальных, профессиональных, информационных и 
# иных потребностей;
# диагностическая, направленная на выявление способностей обучаемых;
# адаптационная, предполагающая проектирование собственной траектории обучения;
# ориентационная, направленная на практическую подготовку к профессиональной деятельности;
# контролирующая, выявляющая образовательные дефициты у обучающегося [3].
# В общем понимании мобильные приложения представляют собой специально разработанные программы, с 
# возможностью установки на той или иной платформе, обладающие определенным функционалом, 
# позволяющим выполнять различные действия и позволяющие трансформировать образовательный процесс, 
# не ограничивая традиционными инструментами, предоставляя неограниченные возможности [9]. 
# Причем, эти возможности направлены на создание наиболее комфортных условий реализации образовательного 
# процесса вне учебного заведения посредством обеспечения доступа к информационным ресурсам [2].

# С помощью таких мобильных приложений обучающиеся имеют возможность решения ряда образовательных 
# задач [4]:

# организация персональной образовательной среды в контексте реализации личностно-ориентированного 
# подхода с учетом индивидуальных образовательных возможностей обучаемого;
# получение доступа к источникам учебной, справочной и иной информации;
# анализ информации, её структурирование, обобщение, вычленение главного;
# организация и реализация проектной работы и проектной деятельности;
# проведение тестирований, опросов и иных различных типов аттестаций;
# подстройка под образовательные потребности и возможности обучаемого;
# возможность отслеживания образовательной динамики;
# персонализация образовательных контентов и иные.

                # 4.Социальная значимость: 

# Создание мобильных приложений может служить социальной цели, 

# решая определенные проблемы или улучшая качество жизни определенных групп людей.
 
# Например, разработка приложений для образования 

# или здравоохранения может значительно улучшить доступность и качество услуг 

# для пользователей.

# Выбор данной темы обоснован стремлением к углубленному пониманию 

# процесса разработки мобильных приложений, 

# их влияния на современное общество 

# и желанием внести свой вклад в развитие этой области.

# Помните, что обоснование выбора темы должно быть конкретным, 

# обоснованным и убедительным, 

# чтобы показать важность и актуальность вашего исследования.